# Pandas - DataFrame

In [2]:
import numpy as np
import pandas as pd
from numpy.random import rand

In [4]:
# We get same random numbers
np.random.seed(101)

In [13]:
df = pd.DataFrame(randn(5, 4), [1, 2, 3, 4, 5], ['A', 'B', 'C', 'D'])

In [14]:
df

          A         B         C         D
1  0.302665  1.693723 -1.706086 -1.159119
2 -0.134841  0.390528  0.166905  0.184502
3  0.807706  0.072960  0.638787  0.329646
4 -0.497104 -0.754070 -0.943406  0.484752
5 -0.116773  1.901755  0.238127  1.996652

In [15]:
df['A']

1    0.302665
2   -0.134841
3    0.807706
4   -0.497104
5   -0.116773
Name: A, dtype: float64

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
type(df['A'])

pandas.core.series.Series

In [18]:
df[['A', 'D']]

          A         D
1  0.302665 -1.159119
2 -0.134841  0.184502
3  0.807706  0.329646
4 -0.497104  0.484752
5 -0.116773  1.996652

In [19]:
df['A+C'] = df['A'] + df['C']

In [20]:
df

          A         B         C         D       A+C
1  0.302665  1.693723 -1.706086 -1.159119 -1.403420
2 -0.134841  0.390528  0.166905  0.184502  0.032064
3  0.807706  0.072960  0.638787  0.329646  1.446493
4 -0.497104 -0.754070 -0.943406  0.484752 -1.440510
5 -0.116773  1.901755  0.238127  1.996652  0.121354

In [24]:
# It not delete column permanantly
df.drop('A+C', axis=1)

          A         B         C         D
1  0.302665  1.693723 -1.706086 -1.159119
2 -0.134841  0.390528  0.166905  0.184502
3  0.807706  0.072960  0.638787  0.329646
4 -0.497104 -0.754070 -0.943406  0.484752
5 -0.116773  1.901755  0.238127  1.996652

In [25]:
df

          A         B         C         D       A+C
1  0.302665  1.693723 -1.706086 -1.159119 -1.403420
2 -0.134841  0.390528  0.166905  0.184502  0.032064
3  0.807706  0.072960  0.638787  0.329646  1.446493
4 -0.497104 -0.754070 -0.943406  0.484752 -1.440510
5 -0.116773  1.901755  0.238127  1.996652  0.121354

In [27]:
# Delete permanantly
df.drop('A+C', axis=1, inplace=True)

In [28]:
df

          A         B         C         D
1  0.302665  1.693723 -1.706086 -1.159119
2 -0.134841  0.390528  0.166905  0.184502
3  0.807706  0.072960  0.638787  0.329646
4 -0.497104 -0.754070 -0.943406  0.484752
5 -0.116773  1.901755  0.238127  1.996652

In [29]:
# Delete row
df.drop(5)

          A         B         C         D
1  0.302665  1.693723 -1.706086 -1.159119
2 -0.134841  0.390528  0.166905  0.184502
3  0.807706  0.072960  0.638787  0.329646
4 -0.497104 -0.754070 -0.943406  0.484752

In [30]:
df

          A         B         C         D
1  0.302665  1.693723 -1.706086 -1.159119
2 -0.134841  0.390528  0.166905  0.184502
3  0.807706  0.072960  0.638787  0.329646
4 -0.497104 -0.754070 -0.943406  0.484752
5 -0.116773  1.901755  0.238127  1.996652

In [31]:
# Select row
df.loc[5]

A   -0.116773
B    1.901755
C    0.238127
D    1.996652
Name: 5, dtype: float64

In [32]:
# Select by index
df.iloc[0]

A    0.302665
B    1.693723
C   -1.706086
D   -1.159119
Name: 1, dtype: float64

In [33]:
# Select perticular value
df.loc[1, 'A']

0.3026654485851825

In [39]:
df.loc[[1, 2, 3], ['A', 'B']]

          A         B
1  0.302665  1.693723
2 -0.134841  0.390528
3  0.807706  0.072960